src/InformationRegisters/ЗамерыПроизводительности/ЗамерыПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамерыПроизводительности</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиЗамерПроизводительности</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗамераUTC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКлючевойОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ВнутренниеЗамерыВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьБуферКлиента(Замеры) Экспорт
    
    УстановитьПривилегированныйРежим(Истина);
    
    ПользовательЗамераПроизводительности = ОбщийСерверПовтИсп.ПолучитьПользователяЗамераПроизводительности(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
    
    НаборЗаписей = РегистрыСведений.ЗамерыПроизводительности.СоздатьНаборЗаписей();
    
    Для Каждого ТекЗамер Из Замеры Цикл
        
        Замер = ТекЗамер.Значение;
        
        ПараметрыЗаписиПроизводительности = ОбщийСерверПовтИсп.ПолучитьПараметрыЗаписиПроизводительности(Замер["ИмяКлючевойОперации"], 1);
        
        НовЗапись = НаборЗаписей.Добавить();
        НовЗапись.ОбъектКонтроля = ПараметрыЗаписиПроизводительности.ОбъектКонтроля;
        НовЗапись.ДатаЗамераUTC = Замер["ДатаНачала"];
        НовЗапись.ИдентификаторКлючевойОперации = ПараметрыЗаписиПроизводительности.УникальныйИдентификаторКлючевойОперации;
        НовЗапись.НомерСеанса = НомерСеансаИнформационнойБазы();
        НовЗапись.Значение = (Замер["ДатаОкончания"] - Замер["ДатаНачала"])/1000;
        НовЗапись.ДатаЗаписи = ТекущаяДата();
        НовЗапись.Пользователь = ПользовательЗамераПроизводительности;
        НовЗапись.УникальныйИдентификаторЗаписи = Новый УникальныйИдентификатор;
        
    КонецЦикла;
    
    НаборЗаписей.Записать(Ложь);
    
    ПериодЗаписи = Константы.ПериодЗаписиВнутреннихЗамеровКлиента.Получить();
    Если НЕ ЗначениеЗаполнено(ПериодЗаписи) Тогда
        ПериодЗаписи = 300;
    КонецЕсли;
        
    УстановитьПривилегированныйРежим(Ложь);
    
    Возврат ПериодЗаписи;
    
КонецФункции

#КонецОбласти
